# 十分钟入门pandas

In [193]:
#coding:utf8
%matplotlib inline

这个一篇针对pandas新手的简短入门，想要了解更多复杂的内容，参阅[*Cookbook*](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

通常，我们首先要导入以下几个库：

In [194]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 创建对象

通过传递一个list来创建**Series**，pandas会默认创建整型索引：

In [195]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

通过传递一个numpy array，日期索引以及列标签来创建一个**DataFrame**：

In [196]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [197]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.781233  1.555815  0.863315 -0.713896
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318
2013-01-04  1.869208  0.221918 -2.222877  0.443911
2013-01-05 -1.410995 -0.633134  0.314796  0.278684
2013-01-06  0.300114  0.436959  0.042070  0.835694

通过传递一个能够被转换为类似series的dict对象来创建一个**DataFrame**:

In [198]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3]*4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

可以看到各列的数据类型为：

In [199]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 查看数据

查看frame中头部和尾部的几行：

In [200]:
df.head()

                   A         B         C         D
2013-01-01 -0.781233  1.555815  0.863315 -0.713896
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318
2013-01-04  1.869208  0.221918 -2.222877  0.443911
2013-01-05 -1.410995 -0.633134  0.314796  0.278684

In [201]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.869208  0.221918 -2.222877  0.443911
2013-01-05 -1.410995 -0.633134  0.314796  0.278684
2013-01-06  0.300114  0.436959  0.042070  0.835694

显示索引、列名以及底层的numpy数据

In [202]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [203]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [204]:
df.values

array([[-7.81232777e-01,  1.55581488e+00,  8.63315141e-01,
        -7.13896231e-01],
       [ 1.73824143e+00, -1.65377701e-03, -1.28993104e+00,
         1.09540852e-01],
       [ 8.79288852e-01,  1.00913834e+00, -1.29559283e+00,
        -1.53731819e+00],
       [ 1.86920842e+00,  2.21918189e-01, -2.22287678e+00,
         4.43911482e-01],
       [-1.41099494e+00, -6.33134453e-01,  3.14796279e-01,
         2.78683864e-01],
       [ 3.00114286e-01,  4.36959397e-01,  4.20702536e-02,
         8.35693627e-01]])

describe()能对数据做一个快速统计汇总

In [205]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.432438  0.431507 -0.598036 -0.097231
std    1.331004  0.769776  1.181859  0.871938
min   -1.410995 -0.633134 -2.222877 -1.537318
25%   -0.510896  0.054239 -1.294177 -0.508037
50%    0.589702  0.329439 -0.623930  0.194112
75%    1.523503  0.866094  0.246615  0.402605
max    1.869208  1.555815  0.863315  0.835694

对数据做转置：

In [206]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.781233    1.738241    0.879289    1.869208   -1.410995    0.300114
B    1.555815   -0.001654    1.009138    0.221918   -0.633134    0.436959
C    0.863315   -1.289931   -1.295593   -2.222877    0.314796    0.042070
D   -0.713896    0.109541   -1.537318    0.443911    0.278684    0.835694

按轴进行排序：

In [207]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.713896  0.863315  1.555815 -0.781233
2013-01-02  0.109541 -1.289931 -0.001654  1.738241
2013-01-03 -1.537318 -1.295593  1.009138  0.879289
2013-01-04  0.443911 -2.222877  0.221918  1.869208
2013-01-05  0.278684  0.314796 -0.633134 -1.410995
2013-01-06  0.835694  0.042070  0.436959  0.300114

按值进行排序 :

In [208]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -1.410995 -0.633134  0.314796  0.278684
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-04  1.869208  0.221918 -2.222877  0.443911
2013-01-06  0.300114  0.436959  0.042070  0.835694
2013-01-03  0.879289  1.009138 -1.295593 -1.537318
2013-01-01 -0.781233  1.555815  0.863315 -0.713896

# 数据选择

注意：虽然标准的Python/Numpy的表达式能完成选择与赋值等功能，但我们仍推荐使用优化过的pandas数据访问方法：.at，.iat，.loc，.iloc和.ix

## 选取

选择某一列数据，它会返回一个**Series**，等同于**df.A**：

In [209]:
df['A']

2013-01-01   -0.781233
2013-01-02    1.738241
2013-01-03    0.879289
2013-01-04    1.869208
2013-01-05   -1.410995
2013-01-06    0.300114
Freq: D, Name: A, dtype: float64

通过使用**[ ]**进行切片选取：

In [210]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.781233  1.555815  0.863315 -0.713896
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318

In [211]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318
2013-01-04  1.869208  0.221918 -2.222877  0.443911

## 通过标签选取

通过标签进行交叉选取：

In [212]:
df.loc[dates[0]]

A   -0.781233
B    1.555815
C    0.863315
D   -0.713896
Name: 2013-01-01 00:00:00, dtype: float64

使用标签对多个轴进行选取

In [213]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.781233  1.555815
2013-01-02  1.738241 -0.001654
2013-01-03  0.879289  1.009138
2013-01-04  1.869208  0.221918
2013-01-05 -1.410995 -0.633134
2013-01-06  0.300114  0.436959

In [214]:
df.loc[:,['A','B']][:3]

                   A         B
2013-01-01 -0.781233  1.555815
2013-01-02  1.738241 -0.001654
2013-01-03  0.879289  1.009138

进行标签切片，包含两个端点

In [215]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.738241 -0.001654
2013-01-03  0.879289  1.009138
2013-01-04  1.869208  0.221918

对于返回的对象进行降维处理

In [216]:
df.loc['20130102',['A','B']]

A    1.738241
B   -0.001654
Name: 2013-01-02 00:00:00, dtype: float64

获取一个标量

In [217]:
df.loc[dates[0],'A']

-0.7812327769995708

快速获取标量（与上面的方法等价）

In [218]:
df.at[dates[0],'A']

-0.7812327769995708

## 通过位置选取

通过传递整型的位置进行选取

In [219]:
df.iloc[3]

A    1.869208
B    0.221918
C   -2.222877
D    0.443911
Name: 2013-01-04 00:00:00, dtype: float64

通过整型的位置切片进行选取，与python/numpy形式相同

In [220]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.869208  0.221918
2013-01-05 -1.410995 -0.633134

只对行进行切片

In [221]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318

只对列进行切片

In [222]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.555815  0.863315
2013-01-02 -0.001654 -1.289931
2013-01-03  1.009138 -1.295593
2013-01-04  0.221918 -2.222877
2013-01-05 -0.633134  0.314796
2013-01-06  0.436959  0.042070

只获取某个值

In [223]:
df.iloc[1,1]

-0.0016537770102429705

快速获取某个值（与上面的方法等价）

In [224]:
df.iat[1,1]

-0.0016537770102429705

## 布尔索引

用某列的值来选取数据

In [225]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.738241 -0.001654 -1.289931  0.109541
2013-01-03  0.879289  1.009138 -1.295593 -1.537318
2013-01-04  1.869208  0.221918 -2.222877  0.443911
2013-01-06  0.300114  0.436959  0.042070  0.835694

用**where**操作来选取数据

In [226]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.555815  0.863315       NaN
2013-01-02  1.738241       NaN       NaN  0.109541
2013-01-03  0.879289  1.009138       NaN       NaN
2013-01-04  1.869208  0.221918       NaN  0.443911
2013-01-05       NaN       NaN  0.314796  0.278684
2013-01-06  0.300114  0.436959  0.042070  0.835694

用**isin()**方法来过滤数据

In [227]:
df2 = df.copy()

In [228]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.781233  1.555815  0.863315 -0.713896    one
2013-01-02  1.738241 -0.001654 -1.289931  0.109541    one
2013-01-03  0.879289  1.009138 -1.295593 -1.537318    two
2013-01-04  1.869208  0.221918 -2.222877  0.443911  three
2013-01-05 -1.410995 -0.633134  0.314796  0.278684   four
2013-01-06  0.300114  0.436959  0.042070  0.835694  three

In [229]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.879289  1.009138 -1.295593 -1.537318   two
2013-01-05 -1.410995 -0.633134  0.314796  0.278684  four

## 赋值

赋值一个新的列，通过索引来自动对齐数据

In [230]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [231]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.781233  1.555815  0.863315 -0.713896  NaN
2013-01-02  1.738241 -0.001654 -1.289931  0.109541  1.0
2013-01-03  0.879289  1.009138 -1.295593 -1.537318  2.0
2013-01-04  1.869208  0.221918 -2.222877  0.443911  3.0
2013-01-05 -1.410995 -0.633134  0.314796  0.278684  4.0
2013-01-06  0.300114  0.436959  0.042070  0.835694  5.0

通过标签赋值

In [232]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  1.555815  0.863315 -0.713896  NaN
2013-01-02  1.738241 -0.001654 -1.289931  0.109541  1.0
2013-01-03  0.879289  1.009138 -1.295593 -1.537318  2.0
2013-01-04  1.869208  0.221918 -2.222877  0.443911  3.0
2013-01-05 -1.410995 -0.633134  0.314796  0.278684  4.0
2013-01-06  0.300114  0.436959  0.042070  0.835694  5.0

通过位置赋值

In [233]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.863315 -0.713896  NaN
2013-01-02  1.738241 -0.001654 -1.289931  0.109541  1.0
2013-01-03  0.879289  1.009138 -1.295593 -1.537318  2.0
2013-01-04  1.869208  0.221918 -2.222877  0.443911  3.0
2013-01-05 -1.410995 -0.633134  0.314796  0.278684  4.0
2013-01-06  0.300114  0.436959  0.042070  0.835694  5.0

通过传递numpy array赋值

In [234]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.863315  5  NaN
2013-01-02  1.738241 -0.001654 -1.289931  5  1.0
2013-01-03  0.879289  1.009138 -1.295593  5  2.0
2013-01-04  1.869208  0.221918 -2.222877  5  3.0
2013-01-05 -1.410995 -0.633134  0.314796  5  4.0
2013-01-06  0.300114  0.436959  0.042070  5  5.0

通过**where**操作来赋值

In [235]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.863315 -5  NaN
2013-01-02 -1.738241 -0.001654 -1.289931 -5 -1.0
2013-01-03 -0.879289 -1.009138 -1.295593 -5 -2.0
2013-01-04 -1.869208 -0.221918 -2.222877 -5 -3.0
2013-01-05 -1.410995 -0.633134 -0.314796 -5 -4.0
2013-01-06 -0.300114 -0.436959 -0.042070 -5 -5.0

# 缺失值处理

在pandas中，用**np.nan**来代表缺失值，这些值默认不会参与运算。

reindex()允许你修改、增加、删除指定轴上的索引，并返回一个数据副本。

In [236]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.863315  5  NaN  1.0
2013-01-02  1.738241 -0.001654 -1.289931  5  1.0  1.0
2013-01-03  0.879289  1.009138 -1.295593  5  2.0  NaN
2013-01-04  1.869208  0.221918 -2.222877  5  3.0  NaN

剔除所有包含缺失值的行数据

In [237]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.738241 -0.001654 -1.289931  5  1.0  1.0

填充缺失值

In [238]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.863315  5  5.0  1.0
2013-01-02  1.738241 -0.001654 -1.289931  5  1.0  1.0
2013-01-03  0.879289  1.009138 -1.295593  5  2.0  5.0
2013-01-04  1.869208  0.221918 -2.222877  5  3.0  5.0

获取值是否为**nan**的布尔标记

In [239]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# 运算

## 统计

运算过程中，通常不包含缺失值。

进行描述性统计

In [240]:
df.mean()

A    0.562643
B    0.172205
C   -0.598036
D    5.000000
F    3.000000
dtype: float64

对其他轴进行同样的运算

In [241]:
df.mean(1)

2013-01-01    1.465829
2013-01-02    1.289331
2013-01-03    1.518567
2013-01-04    1.573650
2013-01-05    1.454133
2013-01-06    2.155829
Freq: D, dtype: float64

对于拥有不同维度的对象进行运算时需要对齐。除此之外，pandas会自动沿着指定维度计算。

In [242]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [243]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.120711  0.009138 -2.295593  4.0  1.0
2013-01-04 -1.130792 -2.778082 -5.222877  2.0  0.0
2013-01-05 -6.410995 -5.633134 -4.685204  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply 函数作用

通过apply()对函数作用

In [244]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.863315   5   NaN
2013-01-02  1.738241 -0.001654 -0.426616  10   1.0
2013-01-03  2.617530  1.007485 -1.722209  15   3.0
2013-01-04  4.486739  1.229403 -3.945086  20   6.0
2013-01-05  3.075744  0.596268 -3.630289  25  10.0
2013-01-06  3.375858  1.033228 -3.588219  30  15.0

In [245]:
df.apply(lambda x:x.max()-x.min())

A    3.280203
B    1.642273
C    3.086192
D    0.000000
F    4.000000
dtype: float64

## 频数统计

In [246]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    4
2    0
3    5
4    3
5    6
6    2
7    5
8    6
9    1
dtype: int32

In [247]:
s.value_counts()

6    2
5    2
0    2
4    1
3    1
2    1
1    1
dtype: int64

## 字符串方法

对于Series对象，在其str属性中有着一系列的字符串处理方法。就如同下段代码一样，能很方便的对array中各个元素进行运算。值得注意的是，在str属性中的模式匹配默认使用正则表达式。

In [248]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 合并

## Concat 连接

pandas中提供了大量的方法能够轻松对Series，DataFrame和Panel对象进行不同满足逻辑关系的合并操作

通过**concat()**来连接pandas对象

In [249]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.411721  0.317850  0.279269  1.820096
1 -0.396447 -1.627918 -1.023740  0.609112
2  2.195165 -0.280207  1.692715  1.799268
3  0.244249 -0.591460 -1.313747 -1.820239
4  0.841170 -0.419302  0.408935  2.185010
5 -0.021621  0.996829 -0.310354  0.221790
6  0.913275  0.769632 -1.488150 -0.605246
7  1.156318  0.131091  0.085333  1.854231
8  1.542004 -0.782850  0.608715  1.085084
9 -1.262707  0.515819 -1.798432 -0.680363

In [250]:
#break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.411721  0.317850  0.279269  1.820096
 1 -0.396447 -1.627918 -1.023740  0.609112
 2  2.195165 -0.280207  1.692715  1.799268,
           0         1         2         3
 3  0.244249 -0.591460 -1.313747 -1.820239
 4  0.841170 -0.419302  0.408935  2.185010
 5 -0.021621  0.996829 -0.310354  0.221790
 6  0.913275  0.769632 -1.488150 -0.605246,
           0         1         2         3
 7  1.156318  0.131091  0.085333  1.854231
 8  1.542004 -0.782850  0.608715  1.085084
 9 -1.262707  0.515819 -1.798432 -0.680363]

In [251]:
pd.concat(pieces)

          0         1         2         3
0 -1.411721  0.317850  0.279269  1.820096
1 -0.396447 -1.627918 -1.023740  0.609112
2  2.195165 -0.280207  1.692715  1.799268
3  0.244249 -0.591460 -1.313747 -1.820239
4  0.841170 -0.419302  0.408935  2.185010
5 -0.021621  0.996829 -0.310354  0.221790
6  0.913275  0.769632 -1.488150 -0.605246
7  1.156318  0.131091  0.085333  1.854231
8  1.542004 -0.782850  0.608715  1.085084
9 -1.262707  0.515819 -1.798432 -0.680363

## Join 合并

类似于SQL中的合并(merge)

In [252]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [253]:
right = pd.DataFrame({'key':['foo', 'foo'], 'lval':[4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [254]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

## Append 添加

将若干行添加到dataFrame后面

In [255]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  2.885830  1.890552 -0.402880  0.006063
1 -0.842369 -0.782319  0.180848  1.668811
2 -0.857673  1.555681  1.376080 -0.516121
3 -1.293976  0.451954  0.223806 -0.616490
4  2.980168  0.696053  1.586638 -0.734640
5  0.040764 -0.520826 -1.241200  0.670598
6 -0.165182 -0.342284  0.078104  0.133367
7 -0.570749 -0.801521  0.428146  0.055583

In [256]:
s = df.iloc[3]
s

A   -1.293976
B    0.451954
C    0.223806
D   -0.616490
Name: 3, dtype: float64

In [257]:
df.append(s, ignore_index=True)

          A         B         C         D
0  2.885830  1.890552 -0.402880  0.006063
1 -0.842369 -0.782319  0.180848  1.668811
2 -0.857673  1.555681  1.376080 -0.516121
3 -1.293976  0.451954  0.223806 -0.616490
4  2.980168  0.696053  1.586638 -0.734640
5  0.040764 -0.520826 -1.241200  0.670598
6 -0.165182 -0.342284  0.078104  0.133367
7 -0.570749 -0.801521  0.428146  0.055583
8 -1.293976  0.451954  0.223806 -0.616490

# 分组

对于“group by”操作，我们通常是指以下一个或几个步骤：
* **划分** 按照某些标准将数据分为不同的组
* **应用** 对每组数据分别执行一个函数
* **组合** 将结果组合到一个数据结构

In [258]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 
                          'foo', 'bar', 'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three', 
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.076987 -1.004456
1  bar    one -1.276827  0.067714
2  foo    two  0.901425  1.038041
3  bar  three -0.257212  0.268276
4  foo    two  0.684162  0.796539
5  bar    two -0.044284  0.883588
6  foo    one  0.920181 -0.371360
7  bar  three -0.134046 -0.510892

分组并对每个分组应用sum函数

In [259]:
df.groupby('A').sum()

            C         D
A
bar -1.712369  0.708685
foo  1.428782  0.458763

按多个列分组形成层级索引，然后应用函数

In [260]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.276827  0.067714
    three -0.391258 -0.242616
    two   -0.044284  0.883588
foo one   -0.156806 -1.375816
    two    1.585587  1.834579

# 变形

## 堆叠

In [261]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [262]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [263]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [264]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.843251  0.728703
      two     0.117562 -0.251727
baz   one     0.880671 -1.542100
      two    -0.120527 -1.160036

**stack()**方法对DataFrame的列“压缩”一个层级

In [265]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.843251
               B    0.728703
       two     A    0.117562
               B   -0.251727
baz    one     A    0.880671
               B   -1.542100
       two     A   -0.120527
               B   -1.160036
dtype: float64

对于一个“堆叠过的”DataFrame或者Series（拥有MultiIndex作为索引），**stack()**的逆操作是**unstack()**，默认反堆叠到上一个层级

In [266]:
stacked.unstack()

                     A         B
first second
bar   one    -0.843251  0.728703
      two     0.117562 -0.251727
baz   one     0.880671 -1.542100
      two    -0.120527 -1.160036

In [267]:
stacked.unstack(1)

second        one       two
first
bar   A -0.843251  0.117562
      B  0.728703 -0.251727
baz   A  0.880671 -0.120527
      B -1.542100 -1.160036

In [268]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.843251  0.880671
       B  0.728703 -1.542100
two    A  0.117562 -0.120527
       B -0.251727 -1.160036

## 数据透视表

In [269]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.728470 -1.017955
1     one  B  foo -1.591243  0.632314
2     two  C  foo -0.391122 -0.488715
3   three  A  bar  0.669582  0.681471
4     one  B  bar  0.194468  0.761923
5     one  C  bar -0.737311 -0.349244
6     two  A  foo -1.100553  0.377487
7   three  B  foo -1.604137 -0.516843
8     one  C  foo  1.912125 -2.061831
9     one  A  bar -0.259073 -0.776055
10    two  B  bar  0.503238 -0.891152
11  three  C  bar -0.190491  0.711919

 我们可以轻松地从这个数据得到透视表

In [270]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.259073  0.728470
      B  0.194468 -1.591243
      C -0.737311  1.912125
three A  0.669582       NaN
      B       NaN -1.604137
      C -0.190491       NaN
two   A       NaN -1.100553
      B  0.503238       NaN
      C       NaN -0.391122

# 时间序列

pandas在对频率转换进行重新采样时拥有着简单，强大而且高效的功能（例如把按秒采样的数据转换为按5分钟采样的数据）。这在金融领域很常见，但又不限于此。

In [271]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [272]:
ts = pd.Series(np.random.randint(0,500,len(rng)), index=rng)
ts

2012-01-01 00:00:00    301
2012-01-01 00:00:01     67
2012-01-01 00:00:02    496
2012-01-01 00:00:03    290
2012-01-01 00:00:04    245
                      ...
2012-01-01 00:01:35     16
2012-01-01 00:01:36    369
2012-01-01 00:01:37    404
2012-01-01 00:01:38    263
2012-01-01 00:01:39    126
Freq: S, Length: 100, dtype: int32

In [274]:
#ts.resample('5Min', how='sum') # 函数resample的‘how’参数已经不适用了，可以将resample(how='last')改成resample.last()的形式
ts.resample('5Min').last()

2012-01-01    126
Freq: 5T, dtype: int32

时区表示

In [ ]:
rng = pd.date_range('3/6/2012', periods=5, freq='D')
rng

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')
ts_utc

时区转换

In [ ]:
ts_utc.tz_convert('US/Eastern')

时间跨度转换

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
rng

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

In [ ]:
ps = ts.to_period()
ps

In [ ]:
ps.to_timestamp()

日期与时间戳之间的转换使得可以使用一些方便的算术函数。例如，我们把以11月为年底的季度数据转换为当前季度末月底为始的数据

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

In [ ]:
ts = pd.Series(np.random.randn(len(prng)), index = prng)
ts

In [ ]:
ts.index = (prng.asfreq('M', 'end') ) .asfreq('H', 'start') +9
ts

# 分类

从版本0.15开始，pandas在**DataFrame**中开始包括分类数据。

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'e', 'e']})
df

把raw_grade转换为分类类型

In [ ]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

重命名类别名为更有意义的名称

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

对分类重新排序，并添加缺失的分类

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

排序是按照分类的顺序进行的，而不是字典序

In [ ]:
df.sort_values(by="grade")

按分类分组时，也会显示空的分类

In [ ]:
df.groupby("grade").size()

# 绘图

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

对于DataFrame类型，**plot()**能很方便地画出所有列及其标签

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

# 获取数据的I/O

## CSV

写入一个csv文件

In [ ]:
df.to_csv('data/foo.csv')

从一个csv文件读入

In [ ]:
pd.read_csv('data/foo.csv')

## HDF5

HDFStores的读写

写入一个HDF5 Store

In [ ]:
df.to_hdf('data/foo.h5', 'df')

从一个HDF5 Store读入

In [ ]:
pd.read_hdf('data/foo.h5', 'df')

## Excel

MS Excel的读写

写入一个Excel文件

In [ ]:
df.to_excel('data/foo.xlsx', sheet_name='Sheet1')

从一个excel文件读入

In [ ]:
pd.read_excel('data/foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])